_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 60)                720       
_________________________________________________________________
dropout_1 (Dropout)          (None, 60)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 120)               7320      
_________________________________________________________________
dropout_2 (Dropout)          (None, 120)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 60)                7260      
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 61        
=================================================================
Total params: 15,361
Trainable params: 15,361
Non-trainable params: 0
_________________________________________________________________
